emacs-config.org
#+TITLE: gnsiva's emacs configuration

* My information

#+BEGIN_SRC emacs-lisp
  (setq user-full-name "Ganesh N. Sivalingam"
        user-mail-address "g.n.sivalingam@gmail.com")
#+END_SRC

* Customize settings location

#+BEGIN_SRC emacs-lisp
  (setq custom-file (expand-file-name "customize-output.el" user-emacs-directory))
  (load custom-file)
#+END_SRC

* Mac customisations

#+BEGIN_SRC emacs-lisp
(when (string-equal system-type "darwin")
(defun open-dir-in-finder ()
    "Open a new Finder window to the path of the current buffer"
    (interactive)
    (start-process "mai-open-dir-process" nil "open" "."))
  (bind-key "C-c o f" 'open-dir-in-finder)

  (defun open-dir-in-iterm ()
    "Open the current directory of the buffer in iTerm."
    (interactive)
    (let* ((iterm-app-path "/Applications/iTerm.app")
           (iterm-brew-path "/opt/homebrew-cask/Caskroom/iterm2/1.0.0/iTerm.app")
           (iterm-path (if (file-directory-p iterm-app-path)
                           iterm-app-path
                         iterm-brew-path)))
      (start-process "mai-open-dir-process" nil "open" "-a" iterm-path ".")))
  (bind-key "C-c o t" 'open-dir-in-iterm))
#+END_SRC

* TODO Packages (disperse contents)

*gtags* 
Installing this package was giving me problems with startup on the mac, so have removed it for now

#+BEGIN_SRC emacs-lisp
  ;; Requisites: Emacs >= 24
  (require 'package)
  (package-initialize)
  ;; TODO already added in init, move this part out
  ;; (add-to-list 'package-archives
  ;;              '("melpa" . "http://melpa.milkbox.net/packages/"))
  ;; ; (add-to-list 'package-archives
  ;; ;            '("marmalade" . "http://marmalade-repo.org/packages/") t)
  ;; (add-to-list 'package-archives
  ;;              '("gnu" . "http://elpa.gnu.org/packages/"))

  (package-refresh-contents)
  (defun install-if-needed (package)
    (unless (package-installed-p package)
      (package-install package)))

  ;; make more packages available with the package installer
  (setq to-install
        '(python-mode cl-lib yasnippet jedi auto-complete autopair find-file-in-repository exec-path-from-shell magit auctex htmlize org emacs-eclim  smartscan nxml git-commit))

  (mapc 'install-if-needed to-install)

  (require 'magit)
  (global-set-key "\C-xg" 'magit-status)
  (global-set-key [f7] 'find-file-in-repository)

  ;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ; These parts should be moved
  ;(require 'flymake)

  ;;;;;;;;;;;;;;;;
  ; yasnippet
  (require 'yasnippet)
  (setq yas-snippet-dirs 
        '("~/yasnippets"))

  ;; ; Different directory for chromebook
  ;; (if (equal system-name "localhost")
  ;;     (setq yas-snippet-dirs '("~/Usb/yasnippets"
  ;;                           "~/yasnippets")))

  (yas-global-mode 1)

  ; Stop yas completion in term/ansi-term and fix tab complete functionality
  (add-hook 'term-mode-hook (lambda ()
                     (yas-minor-mode -1)))

  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; Tramp
  (require 'tramp)
  (setq tramp-default-method "ssh")
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; Others
  ; autopair
  (require 'autopair)
  (autopair-global-mode 1)
  (setq autopair-autowrap t)

  ; auto-complete mode extra settings
  (require 'auto-complete)
  (setq
   ac-auto-start 2
   ac-override-local-map nil
   ac-use-menu-map t
   ac-candidate-limit 20)

#+END_SRC

* Evil mode
The following configuration allows me to use evil mode and emacs together properly.

Normally evil mode keeps you permanently in vim land. This function toggles on and off evil mode so that essentially when you are in vim insert mode, you have full emacs bindings. This allows me to only have to use vim when I want to, and it doesn't screw up the rest of my emacs configuration.

To toggle in and out of vim use M-u, though I plan on changing this. Another issue is that pressing 'i' when in evil mode activates the vim insert mode instead of going back to emacs. Emacs doesn't seem to like setting C-[ to a key, so that's probably something to look into.

Source:
http://makble.com/how-to-toggle-evil-mode-in-emacs

#+BEGIN_SRC emacs-lisp
  (use-package evil
    :ensure t)

  (defun toggle-evilmode ()
    (interactive)
    (if (bound-and-true-p evil-local-mode)
      (progn
        ; go emacs
        (evil-local-mode (or -1 1))
        (undo-tree-mode (or -1 1))
        (set-variable 'cursor-type 'bar)
      )
      (progn
        ; go evil
        (evil-local-mode (or 1 1))
        (set-variable 'cursor-type 'box)
      )
    )
  )
   
  (global-set-key (kbd "M-u") 'toggle-evilmode)

  (use-package powerline
    :ensure t
    :config
    (require 'powerline)
    (powerline-center-theme)) 

  ;; (use-package powerline-evil
  ;;   :ensure t
  ;;   :config
  ;;   (require 'powerline-evil)
  ;;   (powerline-evil-vim-theme))

#+END_SRC
* Org mode
** requires
#+BEGIN_SRC emacs-lisp
(require 'org)
(require 'org-install)
(require 'ox-html)
(require 'ob-tangle)
(require 'ox-latex)
#+END_SRC
** packages
#+BEGIN_SRC emacs-lisp
  (setq org-latex-packages-alist 
        (quote (("" "color" t) ("" "minted" t) ("" "parskip" t))))
#+END_SRC
** general setup
#+BEGIN_SRC emacs-lisp
  (add-hook 'org-mode-hook 'turn-on-visual-line-mode)
  (setq org-startup-indented nil)

  ; (automatically starts files ending in .org in org mode)
  (add-to-list 'auto-mode-alist '("\\.org$" . org-mode))

  ; display images inline
  (if (display-graphic-p)
      (org-display-inline-images t))


  (define-key global-map "\C-cl" 'org-store-link)
  (define-key global-map "\C-ca" 'org-agenda)

  ; log time of completion for tasks
  (setq org-log-done t)
#+END_SRC
** org-bable 
*** setup
#+BEGIN_SRC emacs-lisp
;; Stop org-mode asking for confirmation when executing python code block
(defun my-org-confirm-babel-evaluate (lang body)
  (not (string= lang "python"))) ; don't ask for python
  ;; (not (string= lang "C")))  

(setq org-confirm-babel-evaluate 'my-org-confirm-babel-evaluate)
#+END_SRC
*** languages

This is the list of languages I want to be able to use in org-mode code blocks.

#+BEGIN_SRC emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((python . t)
   (js . t)
   (C . t)
   (org . t)
   (java . t)
   (R . t)
   (sql . t)
   (sh . t)))
#+END_SRC
** Org export
*** setup
#+BEGIN_SRC emacs-lisp
(unless (boundp 'org-export-latex-classes)
  (setq org-export-latex-classes nil))

(setq org-export-latex-listings 'minted)
;; TODO (add-to-list 'org-export-latex-packages-alist '("" "minted"))

; syntax colouring for html at least (and in the buffer)
(setq org-src-fontify-natively t)

; Don't execute all the code blocks when exporting the document
(setq org-export-babel-evaluate nil)

; Put table captions below the table rather than above
(setq org-export-latex-table-caption-above nil)
#+END_SRC

*** LaTeX classes
**** myarticle

+ My standard layout
+ Nice thin borders

#+BEGIN_SRC emacs-lisp
; See part three of this:
; http://orgmode.org/worg/org-tutorials/org-latex-export.html
(add-to-list 'org-latex-classes
             '("myarticle"
"\\documentclass[a4paper,11pt]{article}
\\usepackage{lmodern}
\\usepackage[margin=3cm]{geometry}
\\usepackage{setspace}
\\usepackage{graphicx}
\\onehalfspacing
\\usepackage{etoolbox}
\\AtBeginEnvironment{minted}{\\singlespacing \\fontsize{11}{11}\\selectfont}
\\usepackage[hidelinks]{hyperref}
\\bibliographystyle{unsrt}
"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
#+END_SRC
**** ACS journal format (=acs=)
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-latex-classes
             '("acs"
"\\documentclass[journal=ancham,manuscript=article,layout=twocolumn]{achemso}
\\usepackage{lmodern}
\\usepackage{setspace}
\\usepackage{graphicx}
"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

#+END_SRC
**** PhD corrections (=corrections=)
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-latex-classes
             '("corrections"
"
%\\documentclass[12pt]{article}
\\documentclass[14pt]{extarticle}
\\usepackage[top=3cm, bottom=3cm, left=3cm, right=3cm]{geometry}
% changes vertical space between paragraphs
\\usepackage{parskip}
\\setlength{\\parskip}{10pt}

% Get rid of red boxes around links
\\usepackage{hyperref}
\\hypersetup{
    colorlinks,%
    citecolor=black,%
    filecolor=black,%
    linkcolor=black,%
    urlcolor=black
}
"
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")
               ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
#+END_SRC
**** PhD thesis (=thesis=)
#+BEGIN_SRC emacs-lisp
;; ================================================================
;; Actual thesis format
(add-to-list 'org-latex-classes
             '("thesis"
"\\documentclass[a4paper, twoside]{book}
\\usepackage[fontsize=13pt]{scrextend}
\\usepackage{lmodern}
\\usepackage[lmargin=4cm,rmargin=2cm,tmargin=3cm,bmargin=3.2cm]{geometry}
\\usepackage{graphicx}

\\usepackage{setspace}
\\onehalfspacing

%\\DeclareMathSizes{13}{13}{12}{8}
\\usepackage{xcolor}

% ================
% Header and Footer

% see this for more on fancyhdr (pg 6-7)
% http://texdoc.net/texmf-dist/doc/latex/fancyhdr/fancyhdr.pdf

% fonts for header and footer (pg 14)
\\newcommand{\\hdrFtrFont}{\\fontfamily{cmr}\\fontsize{14}{14}\\selectfont}

\\usepackage{fancyhdr}
\\pagestyle{fancy}
\\renewcommand{\\headrulewidth}{0.4pt}
\\fancyhf{}
\\fancyhead[RO]{\\hdrFtrFont \\nouppercase{\\rightmark}}
\\fancyhead[LE]{\\hdrFtrFont \\nouppercase{\\leftmark}}
\\fancyfoot[LE,RO]{\\hdrFtrFont \\thepage}

% changes vertical space between paragraphs
%\\setlength{\\parskip}{10pt} 

% footnotes - use symbols instead of numbers
\\renewcommand*{\\thefootnote}{\\fnsymbol{footnote}}

% overcoming org mode fail where it wouldn't let me put in a web link properly
\\newcommand{\\clemmerdb}{http://www.indiana.edu/$\\sim$clemmer/Research/Cross\\%20Section\\%20Database/cs\\_database.php}
\\newcommand{\\bushdb}{http://depts.washington.edu/bushlab/ccsdatabase/}
\\newcommand{\\mobcal}{http://www.indiana.edu/$\\sim$nano/software.html}
\\newcommand{\\impact}{http://impact.chem.ox.ac.uk/}
\\newcommand{\\pdblink}{http://www.rcsb.org/pdb/}
\\newcommand{\\maldiFigureLink}{http://www.chm.bris.ac.uk/ms/maldi-ionisation.xhtml}
\\newcommand{\\sigmasoftware}{http://bowers.chem.ucsb.edu/theory\\_analysis/cross-sections/sigma.shtml}
\\newcommand{\\thalassinoslab}{http://www.homepages.ucl.ac.uk/$\\sim$ucbtkth/resources.html}
%\\newcommand{\\}{}
%\\newcommand{\\}{}

% ================================================================
% bibliography
% make bibliography a numbered section in the contents
% \\usepackage[nottoc,notlot,notlof]{tocbibind} % turned it into a chapter, so no good
% change name of bibliography sections to references
\\renewcommand{\\bibname}{References}

% ================
% bibtex per chapter bibliography 
% http://tex.stackexchange.com/questions/87414/per-chapter-bibliographies-in-biblatex

\\usepackage[citestyle=numeric-comp,bibstyle=authoryear,sorting=none,maxbibnames=99,backend=bibtex,refsection=chapter,doi=false,isbn=false,url=false,firstinits=true]{biblatex}
\\AtEveryBibitem{\\clearfield{month}}
\\AtEveryBibitem{\\clearfield{day}}
\\AtEveryBibitem{\\clearfield{series}}
\\AtEveryBibitem{\\clearlist{language}}
\\renewbibmacro{in:}{}
\\renewcommand*{\\mkbibnamefirst}[1]{{\\let~\\,#1}}
\\setlength\\bibitemsep{2\\itemsep}

\\DeclareFieldFormat{bibentrysetcount}{\\mkbibparens{\\mknumalph{#1}}}
\\DeclareFieldFormat{labelnumberwidth}{\\mkbibbrackets{#1}}

\\defbibenvironment{bibliography}
  {\\list
     {\\printtext[labelnumberwidth]{%
    \\printfield{prefixnumber}%
    \\printfield{labelnumber}}}
     {\\setlength{\\labelwidth}{\\labelnumberwidth}%
      \\setlength{\\leftmargin}{\\labelwidth}%
      \\setlength{\\labelsep}{\\biblabelsep}%
      \\addtolength{\\leftmargin}{\\labelsep}%
      \\setlength{\\itemsep}{\\bibitemsep}%
      \\setlength{\\parsep}{\\bibparsep}}%
      \\renewcommand*{\\makelabel}[1]{\\hss##1}}
  {\\endlist}
  {\\item}

\\DeclareNameAlias{sortname}{last-first}

%\\addbibresource{introduction.bib}
%\\addbibresource{1408_a1at.bib}
%\\addbibresource{1306_amphi.bib}
\\addbibresource{1407_challenger.bib}
\\addbibresource{bib-thesis.bib}

% original
%\\bibliographystyle{unsrt} 
%\\usepackage[superscript,biblabel]{cite}

% ================================================================

\\usepackage[font=singlespacing,font=footnotesize,width=.75\\textwidth]{caption}
\\usepackage{etoolbox}
\\AtBeginEnvironment{minted}{\\singlespacing \\fontsize{8}{8}\\selectfont}
\\usepackage[hidelinks]{hyperref}
\\usepackage{cancel}
"
               ("\\chapter{%s}" . "\\chapter*{%s}")
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
               ("\\paragraph{%s}" . "\\paragraph*{%s}")))

#+END_SRC
*** RefTex setup
#+BEGIN_SRC emacs-lisp
;; ================ 
;; RefTex
;; Configure RefTeX for use with org-mode. At the end of your
;; org-mode file you need to insert your style and bib file:
;; \bibliographystyle{plain}
;; \bibliography{ProbePosition}
;; See http://www.mfasold.net/blog/2009/02/using-emacs-org-mode-to-draft-papers/
(defun org-mode-reftex-setup ()
  (load-library "reftex")
  (and (buffer-file-name)
       (file-exists-p (buffer-file-name))
       (reftex-parse-all))
  (define-key org-mode-map (kbd "<f8>") 'reftex-citation))

(add-hook 'org-mode-hook 'org-mode-reftex-setup)
#+END_SRC
